// SPDX-FileCopyrightText: 2026 Epic Games, Inc.
// SPDX-License-Identifier: MIT
/* automatically generated by rust-bindgen 0.71.1 */

pub const SWFS_MAX_PATH: u32 = 32768;
pub type swfs_ubyte = ::std::os::raw::c_uchar;
pub type swfs_utf8 = ::std::os::raw::c_char;
pub type swfs_utf16 = ::std::os::raw::c_ushort;
pub type swfs_u8 = ::std::os::raw::c_uchar;
pub type swfs_u16 = ::std::os::raw::c_ushort;
pub type swfs_u32 = ::std::os::raw::c_uint;
pub type swfs_u64 = ::std::os::raw::c_ulonglong;
pub type SWFSHandle = *mut ::std::os::raw::c_void;
pub type bool_ = ::std::os::raw::c_int;
pub const SWFSFileAccess_Enum_SWFSFileAccess_Read: SWFSFileAccess_Enum = 1;
pub const SWFSFileAccess_Enum_SWFSFileAccess_Write: SWFSFileAccess_Enum = 2;
pub const SWFSFileAccess_Enum_SWFSFileAccess_FailIfExists: SWFSFileAccess_Enum = 4;
pub const SWFSFileAccess_Enum_SWFSFileAccess_FailIfNotExist: SWFSFileAccess_Enum = 8;
pub const SWFSFileAccess_Enum_SWFSFileAccess_AppendIfExists: SWFSFileAccess_Enum = 16;
pub const SWFSFileAccess_Enum_SWFSFileAccess_OverwriteIfExists: SWFSFileAccess_Enum = 32;
pub type SWFSFileAccess_Enum = ::std::os::raw::c_uint;
pub const SWFSDeleteStatus_Enum_SWFSDeleteStatus_Success: SWFSDeleteStatus_Enum = 0;
pub const SWFSDeleteStatus_Enum_SWFSDeleteStatus_Success_NoRollback: SWFSDeleteStatus_Enum = 1;
pub const SWFSDeleteStatus_Enum_SWFSDeleteStatus_Failed_FileNotFound: SWFSDeleteStatus_Enum = 2;
pub const SWFSDeleteStatus_Enum_SWFSDeleteStatus_Failed_AccessDenied: SWFSDeleteStatus_Enum = 3;
pub const SWFSDeleteStatus_Enum_SWFSDeleteStatus_Failed_Unknown: SWFSDeleteStatus_Enum = 4;
pub type SWFSDeleteStatus_Enum = ::std::os::raw::c_uint;
pub const SWFSDeleteResult_Enum_SWFSDeleteResult_Force: SWFSDeleteResult_Enum = 0;
pub const SWFSDeleteResult_Enum_SWFSDeleteResult_Continue: SWFSDeleteResult_Enum = 1;
pub const SWFSDeleteResult_Enum_SWFSDeleteResult_Cancel: SWFSDeleteResult_Enum = 2;
pub const SWFSDeleteResult_Enum_SWFSDeleteResult_Rollback: SWFSDeleteResult_Enum = 3;
pub type SWFSDeleteResult_Enum = ::std::os::raw::c_uint;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFill: SWFSPerfTime_Enum = 0;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillAcquireDirBuff: SWFSPerfTime_Enum = 1;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillOpenDirFromCallingProgram: SWFSPerfTime_Enum = 2;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillFromCallingProgram: SWFSPerfTime_Enum = 3;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillCloseDirFromCallingProgram: SWFSPerfTime_Enum = 4;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillCleanUp: SWFSPerfTime_Enum = 5;
pub const SWFSPerfTime_Enum_SWFSPerfTime_DirFillReadDirBuff: SWFSPerfTime_Enum = 6;
pub const SWFSPerfTime_Enum_SWFSPerfTime_MAX: SWFSPerfTime_Enum = 7;
pub type SWFSPerfTime_Enum = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SWFSPerfTimers {
    pub timers: [swfs_u64; 7usize],
    pub counts: [swfs_u64; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SWFSPerfTimers"][::std::mem::size_of::<SWFSPerfTimers>() - 112usize];
    ["Alignment of SWFSPerfTimers"][::std::mem::align_of::<SWFSPerfTimers>() - 8usize];
    ["Offset of field: SWFSPerfTimers::timers"]
        [::std::mem::offset_of!(SWFSPerfTimers, timers) - 0usize];
    ["Offset of field: SWFSPerfTimers::counts"]
        [::std::mem::offset_of!(SWFSPerfTimers, counts) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SWFSFile {
    pub filename: *mut swfs_utf8,
    pub file_attributes: swfs_u32,
    pub access: swfs_u32,
    pub size: swfs_u64,
    pub creation_time: swfs_u64,
    pub last_access_time: swfs_u64,
    pub change_time: swfs_u64,
    pub user_data: *mut ::std::os::raw::c_void,
    pub next: *mut SWFSFile,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SWFSFile"][::std::mem::size_of::<SWFSFile>() - 64usize];
    ["Alignment of SWFSFile"][::std::mem::align_of::<SWFSFile>() - 8usize];
    ["Offset of field: SWFSFile::filename"][::std::mem::offset_of!(SWFSFile, filename) - 0usize];
    ["Offset of field: SWFSFile::file_attributes"]
        [::std::mem::offset_of!(SWFSFile, file_attributes) - 8usize];
    ["Offset of field: SWFSFile::access"][::std::mem::offset_of!(SWFSFile, access) - 12usize];
    ["Offset of field: SWFSFile::size"][::std::mem::offset_of!(SWFSFile, size) - 16usize];
    ["Offset of field: SWFSFile::creation_time"]
        [::std::mem::offset_of!(SWFSFile, creation_time) - 24usize];
    ["Offset of field: SWFSFile::last_access_time"]
        [::std::mem::offset_of!(SWFSFile, last_access_time) - 32usize];
    ["Offset of field: SWFSFile::change_time"]
        [::std::mem::offset_of!(SWFSFile, change_time) - 40usize];
    ["Offset of field: SWFSFile::user_data"][::std::mem::offset_of!(SWFSFile, user_data) - 48usize];
    ["Offset of field: SWFSFile::next"][::std::mem::offset_of!(SWFSFile, next) - 56usize];
};
pub type SWFSOpenFileReadFn = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, out_file: *mut SWFSFile) -> bool_,
>;
pub type SWFSCloseFileReadFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle, out_file: *mut SWFSFile)>;
pub type SWFSReadFile = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        file: *mut SWFSFile,
        out_buffer: *mut ::std::os::raw::c_void,
        read_offset: swfs_u64,
        num_bytes_to_read: swfs_u64,
    ) -> swfs_u64,
>;
pub type SWFSOpenDir = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, dir_handle: *mut SWFSFile) -> bool_,
>;
pub type SWFSFillDirFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        dir_handle: *mut SWFSFile,
        out_files: *mut *mut SWFSFile,
    ) -> swfs_u32,
>;
pub type SWFSCloseDirFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        dir_handle: *mut SWFSFile,
        files: *mut SWFSFile,
        num_files: swfs_u32,
    ),
>;
pub type SWFSIsFileIgnored = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, path: *const swfs_utf8) -> bool_,
>;
pub type SWFSNotifyOpenWriteFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle, swfs_file: *mut SWFSFile)>;
pub type SWFSNotifyCloseWriteFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle, swfs_file: *mut SWFSFile)>;
pub type SWFSNotifyCreateFileFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle, swfs_file: *mut SWFSFile)>;
pub type SWFSNotifyMoveFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        old_file: *mut SWFSFile,
        new_file: *mut SWFSFile,
    ) -> bool_,
>;
pub type SWFSNotifyDeleteFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        swfs_file: *mut SWFSFile,
        arg1: SWFSDeleteStatus_Enum,
    ) -> SWFSDeleteResult_Enum,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SWFSCallbacks {
    pub open_file_read: SWFSOpenFileReadFn,
    pub close_file_read: SWFSCloseFileReadFn,
    pub read_file: SWFSReadFile,
    pub open_dir: SWFSOpenDir,
    pub fill_dir: SWFSFillDirFn,
    pub close_dir: SWFSCloseDirFn,
    pub is_file_ignored: SWFSIsFileIgnored,
    pub notify_open_write: SWFSNotifyOpenWriteFn,
    pub notify_close_write: SWFSNotifyCloseWriteFn,
    pub notify_create: SWFSNotifyCreateFileFn,
    pub notify_move: SWFSNotifyMoveFn,
    pub notify_delete: SWFSNotifyDeleteFn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SWFSCallbacks"][::std::mem::size_of::<SWFSCallbacks>() - 96usize];
    ["Alignment of SWFSCallbacks"][::std::mem::align_of::<SWFSCallbacks>() - 8usize];
    ["Offset of field: SWFSCallbacks::open_file_read"]
        [::std::mem::offset_of!(SWFSCallbacks, open_file_read) - 0usize];
    ["Offset of field: SWFSCallbacks::close_file_read"]
        [::std::mem::offset_of!(SWFSCallbacks, close_file_read) - 8usize];
    ["Offset of field: SWFSCallbacks::read_file"]
        [::std::mem::offset_of!(SWFSCallbacks, read_file) - 16usize];
    ["Offset of field: SWFSCallbacks::open_dir"]
        [::std::mem::offset_of!(SWFSCallbacks, open_dir) - 24usize];
    ["Offset of field: SWFSCallbacks::fill_dir"]
        [::std::mem::offset_of!(SWFSCallbacks, fill_dir) - 32usize];
    ["Offset of field: SWFSCallbacks::close_dir"]
        [::std::mem::offset_of!(SWFSCallbacks, close_dir) - 40usize];
    ["Offset of field: SWFSCallbacks::is_file_ignored"]
        [::std::mem::offset_of!(SWFSCallbacks, is_file_ignored) - 48usize];
    ["Offset of field: SWFSCallbacks::notify_open_write"]
        [::std::mem::offset_of!(SWFSCallbacks, notify_open_write) - 56usize];
    ["Offset of field: SWFSCallbacks::notify_close_write"]
        [::std::mem::offset_of!(SWFSCallbacks, notify_close_write) - 64usize];
    ["Offset of field: SWFSCallbacks::notify_create"]
        [::std::mem::offset_of!(SWFSCallbacks, notify_create) - 72usize];
    ["Offset of field: SWFSCallbacks::notify_move"]
        [::std::mem::offset_of!(SWFSCallbacks, notify_move) - 80usize];
    ["Offset of field: SWFSCallbacks::notify_delete"]
        [::std::mem::offset_of!(SWFSCallbacks, notify_delete) - 88usize];
};
pub const SWFSInitFlags_Enum_SWFSInitFlags_ConsoleLog: SWFSInitFlags_Enum = 0;
pub const SWFSInitFlags_Enum_SWFSInitFlags_ConsoleLogKernelDriver: SWFSInitFlags_Enum = 1;
pub type SWFSInitFlags_Enum = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SWFSInit {
    pub name: *const swfs_utf8,
    pub write_dir: *const swfs_utf8,
    pub mount_point: *const swfs_utf8,
    pub flags: swfs_u32,
    pub perf_count_lg2: ::std::os::raw::c_int,
    pub num_threads: ::std::os::raw::c_int,
    pub log_hash_num_buckets_lg2: ::std::os::raw::c_int,
    pub callbacks: SWFSCallbacks,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SWFSInit"][::std::mem::size_of::<SWFSInit>() - 136usize];
    ["Alignment of SWFSInit"][::std::mem::align_of::<SWFSInit>() - 8usize];
    ["Offset of field: SWFSInit::name"][::std::mem::offset_of!(SWFSInit, name) - 0usize];
    ["Offset of field: SWFSInit::write_dir"][::std::mem::offset_of!(SWFSInit, write_dir) - 8usize];
    ["Offset of field: SWFSInit::mount_point"]
        [::std::mem::offset_of!(SWFSInit, mount_point) - 16usize];
    ["Offset of field: SWFSInit::flags"][::std::mem::offset_of!(SWFSInit, flags) - 24usize];
    ["Offset of field: SWFSInit::perf_count_lg2"]
        [::std::mem::offset_of!(SWFSInit, perf_count_lg2) - 28usize];
    ["Offset of field: SWFSInit::num_threads"]
        [::std::mem::offset_of!(SWFSInit, num_threads) - 32usize];
    ["Offset of field: SWFSInit::log_hash_num_buckets_lg2"]
        [::std::mem::offset_of!(SWFSInit, log_hash_num_buckets_lg2) - 36usize];
    ["Offset of field: SWFSInit::callbacks"][::std::mem::offset_of!(SWFSInit, callbacks) - 40usize];
};
pub type SWFSReadModCBFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        buff: *const ::std::os::raw::c_char,
        num_bytes_written: ::std::os::raw::c_int,
        min_num_bytes: ::std::os::raw::c_int,
        num_bytes_new_buff: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char,
>;
pub type SWFSInitFn = ::std::option::Option<
    unsafe extern "C" fn(init: *mut SWFSInit, out_swfs_handle: *mut SWFSHandle) -> bool_,
>;
pub type SWFSCloseFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle) -> bool_>;
pub type SWFSSetFileCaseFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        file_handle: *mut SWFSFile,
        filename: *const swfs_utf8,
    ) -> bool_,
>;
pub type SWFSIsRunningFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle) -> bool_>;
pub type SWFSGetActiveModsFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        buff: *mut ::std::os::raw::c_char,
        num_bytes: ::std::os::raw::c_int,
        callback: SWFSReadModCBFn,
    ) -> *mut ::std::os::raw::c_char,
>;
pub type SWFSSetUserDataFn = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, user_data: *mut ::std::os::raw::c_void),
>;
pub type SWFSGetUserDataFn = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle) -> *mut ::std::os::raw::c_void,
>;
pub type SWFSPerfResetTimersFn =
    ::std::option::Option<unsafe extern "C" fn(swfs_handle: SWFSHandle)>;
pub type SWFSPerfGetTimersFn = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, out_timers: *mut SWFSPerfTimers) -> bool_,
>;
pub type SWFSPerfSerializeFn = ::std::option::Option<
    unsafe extern "C" fn(
        swfs_handle: SWFSHandle,
        out_mem: *mut *mut ::std::os::raw::c_void,
    ) -> swfs_u64,
>;
pub type SWFSPerfFreeSerializedDataFn = ::std::option::Option<
    unsafe extern "C" fn(swfs_handle: SWFSHandle, mem: *mut ::std::os::raw::c_void),
>;
unsafe extern "C" {
    pub fn swfsInitFn(init: *mut SWFSInit, out_swfs_handle: *mut SWFSHandle) -> bool_;
}
unsafe extern "C" {
    pub fn swfsCloseFn(swfs_handle: SWFSHandle) -> bool_;
}
unsafe extern "C" {
    pub fn swfsSetFileCaseFn(
        swfs_handle: SWFSHandle,
        file_handle: *mut SWFSFile,
        filename: *const swfs_utf8,
    ) -> bool_;
}
unsafe extern "C" {
    pub fn swfsIsRunningFn(swfs_handle: SWFSHandle) -> bool_;
}
unsafe extern "C" {
    pub fn swfsGetActiveModsFn(
        swfs_handle: SWFSHandle,
        buff: *mut ::std::os::raw::c_char,
        num_bytes: ::std::os::raw::c_int,
        callback: SWFSReadModCBFn,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn swfsSetUserDataFn(swfs_handle: SWFSHandle, user_data: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn swfsGetUserDataFn(swfs_handle: SWFSHandle) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn swfsPerfResetTimersFn(swfs_handle: SWFSHandle);
}
unsafe extern "C" {
    pub fn swfsPerfGetTimersFn(swfs_handle: SWFSHandle, out_timers: *mut SWFSPerfTimers) -> bool_;
}
unsafe extern "C" {
    pub fn swfsPerfSerializeFn(
        swfs_handle: SWFSHandle,
        out_mem: *mut *mut ::std::os::raw::c_void,
    ) -> swfs_u64;
}
unsafe extern "C" {
    pub fn swfsPerfFreeSerializedDataFn(swfs_handle: SWFSHandle, mem: *mut ::std::os::raw::c_void);
}
